# Problem 1:
Here are five functions of pandas library.
* head() : This function returns the first (n) rows of a DataFrame or a Series.
* info() : This function prints a summary of a DataFrame, including the index dtype and columns, non-null values and memory usage.
* sort_values() : This function sorts a DataFrame or a Series by the values along either axis. 
* describe() : This function returns a statistical summary of a DataFrame.
* to_csv() : This function writes a DataFrame to a CSV file.

Examples are given below

In [5]:
import pandas as pd

df = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 'age': [25, 32, 28, 41, 23], 'gender': ['F', 'M', 'M', 'M', 'F']})
df.head(3)

      name  age gender
0    Alice   25      F
1      Bob   32      M
2  Charlie   28      M

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   gender  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [19]:
df.sort_values(by='age')

      name  age gender
4      Eve   23      F
0    Alice   25      F
2  Charlie   28      M
1      Bob   32      M
3    David   41      M

In [20]:
df.describe()

             age
count   5.000000
mean   29.800000
std     7.120393
min    23.000000
25%    25.000000
50%    28.000000
75%    32.000000
max    41.000000

In [ ]:
df.to_csv('new_file_example.csv')

# Problem 2:

In [75]:
import pandas as pd
df = pd.DataFrame( {'A': [10, 20, 30, 40, 50],
        'B': ['a', 'b', 'c', 'd', 'e'],
        'C': [50, 40, 30, 20, 10]})

In [76]:
df

    A  B   C
0  10  a  50
1  20  b  40
2  30  c  30
3  40  d  20
4  50  e  10

In [77]:
def reindex_dataframe(df):
    df.index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    
    
    return df

In [78]:
reindex_dataframe(df)

    A  B   C
1  10  a  50
3  20  b  40
5  30  c  30
7  40  d  20
9  50  e  10

# Problem 3:

In [86]:
import pandas as pd
df = pd.DataFrame( {'Values': [10, 20, 30, 40, 50],
        'B': ['a', 'b', 'c', 'd', 'e'],
        'C': [50, 40, 30, 20, 10]})

In [81]:
df

   Values  B   C
0      10  a  50
1      20  b  40
2      30  c  30
3      40  d  20
4      50  e  10

In [85]:
def sum_of_three_values(df):
    result_sum = df[0:3]['Values'].sum()
    return result_sum

In [87]:
sum_of_three_values(df)

60

# Problem 4:

In [89]:
data = {'Text': ['Hellow world', 'Today is sunday']}
df = pd.DataFrame(data)

In [106]:
def word_count(df):
    df['word count'] = df['Text'].apply(lambda x : len(x.split()))
    return df

In [107]:
word_count(df)

              Text  word count
0     Hellow world           2
1  Today is sunday           3

# Problem 5:

In [115]:
df

              Text  word count
0     Hellow world           2
1  Today is sunday           3

DataFrame.size() returns the total number of elements in the DataFrame, which is equivalent to the number of rows multiplied by the number of columns. It returns a single integer value.

In [111]:
df.size

4

DataFrame.shape() returns a tuple of integers representing the dimensions of the DataFrame. The first element of the tuple is the number of rows, and the second element is the number of columns.

In [114]:
df.shape

(2, 2)

# Problem 6:
The function in pandas that is used to read an Excel file is read_excel().

# Problem 7:

In [132]:
df = pd.DataFrame({'Email':['ashim@gmail.com', 'aju.dutta@gmail.com']})

In [133]:
def username_extract(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

In [134]:
username_extract(df)

                 Email   Username
0      ashim@gmail.com      ashim
1  aju.dutta@gmail.com  aju.dutta

# Problem 8:

In [144]:
df = pd.DataFrame({'A':[3,8,6,2,9], 'B':[5,2,9,3,1], 'C':[1,7,4,5,2]})

In [145]:
def df_filter(df):
    df_new = df[(df['A'] > 5) & (df['B'] < 10)]
    return df_new

In [146]:
df_filter(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Problem 9:

In [148]:
df = pd.DataFrame( {'Values': [10, 20, 30, 40, 50]})

In [151]:
def statistical_parameters(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    return {'Mean': mean, 'Median': median, 'Std_dev': std_dev}

In [152]:
statistical_parameters(df)

{'Mean': 30.0, 'Median': 30.0, 'Std_dev': 15.811388300841896}

# Problem 10:

In [166]:
df = pd.DataFrame({'Sales':[10, 12 , 11, 15, 16, 20, 22, 23, 30, 25, 35], 'Date': pd.date_range(start = '2023-03-01', end = '2023-03-11')})

In [167]:
df

    Sales       Date
0      10 2023-03-01
1      12 2023-03-02
2      11 2023-03-03
3      15 2023-03-04
4      16 2023-03-05
5      20 2023-03-06
6      22 2023-03-07
7      23 2023-03-08
8      30 2023-03-09
9      25 2023-03-10
10     35 2023-03-11

In [168]:
def ave_7day(df):
    df['7 day average'] = df['Sales'].rolling(window = 7).mean()
    return df

In [169]:
ave_7day(df)

    Sales       Date  7 day average
0      10 2023-03-01            NaN
1      12 2023-03-02            NaN
2      11 2023-03-03            NaN
3      15 2023-03-04            NaN
4      16 2023-03-05            NaN
5      20 2023-03-06            NaN
6      22 2023-03-07      15.142857
7      23 2023-03-08      17.000000
8      30 2023-03-09      19.571429
9      25 2023-03-10      21.571429
10     35 2023-03-11      24.428571

# Problem 11:

In [170]:
df = pd.DataFrame({'Date': pd.date_range(start = '2023-03-01', end = '2023-03-11') })

In [176]:
def weekdays(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [177]:
weekdays(df)

         Date    Weekday
0  2023-03-01  Wednesday
1  2023-03-02   Thursday
2  2023-03-03     Friday
3  2023-03-04   Saturday
4  2023-03-05     Sunday
5  2023-03-06     Monday
6  2023-03-07    Tuesday
7  2023-03-08  Wednesday
8  2023-03-09   Thursday
9  2023-03-10     Friday
10 2023-03-11   Saturday

# Problem 12:

In [184]:
df = pd.DataFrame({'Date': pd.date_range(start = '2023-01-01', end = '2023-03-01') })
df['Weekday'] = df['Date'].dt.day_name()

In [185]:
def crop_df(df):
    df_new = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return df_new

In [186]:
 crop_df(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday
6  2023-01-07   Saturday
7  2023-01-08     Sunday
8  2023-01-09     Monday
9  2023-01-10    Tuesday
10 2023-01-11  Wednesday
11 2023-01-12   Thursday
12 2023-01-13     Friday
13 2023-01-14   Saturday
14 2023-01-15     Sunday
15 2023-01-16     Monday
16 2023-01-17    Tuesday
17 2023-01-18  Wednesday
18 2023-01-19   Thursday
19 2023-01-20     Friday
20 2023-01-21   Saturday
21 2023-01-22     Sunday
22 2023-01-23     Monday
23 2023-01-24    Tuesday
24 2023-01-25  Wednesday
25 2023-01-26   Thursday
26 2023-01-27     Friday
27 2023-01-28   Saturday
28 2023-01-29     Sunday
29 2023-01-30     Monday
30 2023-01-31    Tuesday

# Problem 13:
The first and foremost necessary library that needs to be imported to use basic functions in pandas is 'pandas' itself.